Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_3_how_income_can_affect_jobseekers_allowance.html.txt.tmx
Source language: en
Languages: ga

source: Case study 3: How income from work can affect Jobseeker's Allowance
ga: Cás-staidéar 3: Conas a bhíonn tionchar ag ioncam ón obair ar Liúntas do Lucht Cuardaigh Fostaíochta

source: Case study showing how Jobseeker's Allowance is affected by a spouse or partner's income in 2012
ga: Cás-staidéar ina léirítear conas a bhíonn tionchar ag ioncam céile nó páirtí ar Liúntas do Lucht Cuardaigh Fostaíochta in 2012

source: Anna is getting Jobseeker's Allowance and is living with her partner Paul
ga: Tá Anna ina cónaí lena páirtí Paul

source: Paul has been getting Invalidity Pension for a couple of years now
ga: Tá Pinsean Easláinte á fháil ag Paul le cúpla bliain anuas

source: He has been offered some rehabilitative work for three mornings each week
ga: Tairgeadh roinnt obair athshlánúcháin dó ar feadh trí mhaidin gach seachtain

source: He knows his earnings of €110 from rehabilitative work will not affect his Invalidity Pension
ga: Tá a fhios aige nach mbeidh tionchar ag a thuilleamh €110 ón obair athshlánúcháin ar a Phinsean Easláinte

source: However, Anna wants to know if her Jobseeker's Allowance will be affected if Paul takes up rehabilitative work. Her payment is already reduced because they are living together
ga: Ach teastaíonn ó Anna a fháil amach an gcuirfear isteach ar a Liúntas do Lucht Cuardaigh Fostaíochta má thugann Paul faoin obair athshlánúcháin

source: Note that from 2012 people gettting Invalidity Pension can no longer get exemptions for rehabilitative work
ga: Tá a híocaíocht laghdaithe cheana féin toisc go bhfuil siad ina gcónaí le chéile

source: Step 1: Find Anna's current rate of Jobseeker's Allowance (JA)
ga: Céim 1: Ríomh ráta an Liúntais do Lucht Cuardaigh Fostaíochta (LLCF) a fhaigheann Anna faoi láthair

source: Maximum payment to Anna and Paul (note 1) €331.60
ga: Uasíocaíocht le Anna agus Paul (nóta 1) €331.60

source: Paul's rate of Invalidity Pension €193.50
ga: An Ráta Pinsean Easláinte a fhaigheann Paul €193.50

source: Anna's rate of Jobseeker's Allowance (note 1) €138.10
ga: Ráta an Liúntais do Lucht Cuardaigh Fostaíochta a fhaigheann Anna (nóta 1) €138.10

source: Total social welfare payments €331.60
ga: Íocaíochtaí leasa shóisialaigh iomlána €331.60

source: Step 2: Find Anna's rate of JA after Paul's income from rehabilitative earnings is taken into account
ga: Céim 2: Ríomh ráta LLCF Anna tar éis tuilleamh athshlánúcháin Paul a chur san áireamh

source: Anna's current reduced rate of Jobseeker's Allowance €138.10
ga: Ráta Laghdaithe an Liúntais do Lucht Cuardaigh Fostaíochta a fhaigheann Anna faoi láthair €138.10

source: Less assessable income from Paul's rehabilitative work €15 (note 2)
ga: Lúideioncam inmheasúnaithe ó obair athshlánúcháin Paul €15 (nóta 2)

source: Anna's new rate of Jobseeker's Allowance €123.10
ga: Ráta nua an Liúntais do Lucht Cuardaigh Fostaíochta a fhaigheann Anna €123.10

source: If one of a couple is claiming Jobseeker's Allowance and the other is getting of one of the social welfare payments listed below, the total amount paid to the couple cannot exceed the amount paid to one person and his/her adult dependant
ga: Má éilíonn duine den lánúin an Liúntas do Lucht Cuardaigh Fostaíochta agus má fhaigheann an duine eile ceann amháin de na híocaíochtaí leasa shóisialaigh atá ar an liosta thíos, ní féidir leis an méid iomlán a íoctar leis an lánúin a bheith níos mó ná an méid a íoctar le duine amháin agus a c(h)leithiúnaí aosaigh

source: • Disablement Pension (when paid with Injury Benefit or Incapacity Supplement)
ga: • Pinsean Míchumais (nuair a íoctar in éineacht le Sochar Díobhála nó Forlíonadh Éagumais é)

source: However, you can choose the higher-rate payment as the primary payment
ga: Is féidir leat an íocaíocht ag an ráta níos airde a roghnú mar an phríomhíocaíocht, áfach

source: For example, Anna and Paul have choosen Paul's Invalidity Pension as the primary payment rather than Anna's Jobseeker's Allowance because Invalidity Pension is paid at a higher weekly rate
ga: Mar shampla, roghnaigh Anna agus Paul Pinsean Easláinte Paul mar phríomhíocaíocht seachas Liúntas do Lucht Cuardaigh Fostaíochta Anna mar íoctar an Pinsean Easláinte ag ráta seachtainiúil níos airde

source: Claimant on Invalidity Pension (IP) under 65 years rate €193.50
ga: Éilitheoir ar Phinsean Easláinte (PE) ar an ráta faoi 65 bliain d’aois €193.50

source: Qualified Adult rate for IP under 65 years €138.10
ga: Ráta d’Aosach Cáilithe do PE faoi 65 bliain d’aois €138.10

source: Maximum payable to Anna and Paul €331.60
ga: Uasmhéid iníoctha le Anna agus Paul €331.60

source: Paul's income will affect Anna's rate of Jobseeker's Allowance
ga: Beidh tionchar ag ioncam Paul ar Ráta an Liúntais do Lucht Cuardaigh Fostaíochta a fhaigheann Anna

source: Paul’s income from employment is €110
ga: Is é an t-ioncam ó fhostaíocht a fhaigheann Paul ná €110

source: €20 per day from casual work (up to a maximum of €60) will be deducted from his average assessable weekly earnings and 60% of the balance will be assessed as his means from employment
ga: Déanfar €20 in aghaidh an lae ó obair ócáideach (suas le huasmhéid de €60) a asbhaint óna mheántuilleamh inmheasúnaithe seachtainiúil, agus déanfar 60% den fhuílleach a mheasúnú mar a acmhainní ó fhostaíocht

source: €110 - €60 (3 days worked) = €50 x 60% = €30
ga: €110 – €60 (oibríodh 3 lá) = €50 x 60% = €30

source: Means of €30 is halved because Paul is getting a social welfare payment
ga: Déantar leath dá acmhainní €30 toisc go bhfuil íocaíocht leasa shóisialaigh á fáil ag Paul

source: Total weekly means = €15
ga: Acmhainní iomlána seachtainiúla = €15

source: • PRSA (Personal Retirement Savings Account)
ga: • CCSP (Cuntas Coigiltis Scoir Pearsanta)
